Autodesk.Revit.DB.Electrical.CableTrayConduitRunBase.Length
The length of the whole (cable tray or conduit) run
default 0.0

Autodesk.Revit.DB.Electrical.CableTrayConduitRunBase
The base class for a cable tray or conduit run in Autodesk Revit.